linear.measurement.mongo.routine.original.v.1.17/mongo.op_routine.threads_20.mes_4.dat
//bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/mongodb/target/dependency/logback-classic-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/mongodb/target/dependency/logback-core-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/mongodb/target/dependency/mongo-java-driver-3.11.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/mongodb/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/mongodb/target/dependency/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -s -P workloads/workloadb -p recordcount=15585 -threads 20 -p mongodb.url=mongodb://localhost:27017/ycsb?w=0
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 828
[OVERALL], Throughput(ops/sec), 1207.729468599034
[TOTAL_GCS_G1_Young_Generation], Count, 10
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 64
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 7.729468599033816
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 10
[TOTAL_GC_TIME], Time(ms), 64
[TOTAL_GC_TIME_%], Time(%), 7.729468599033816
[READ], Operations, 944
[READ], AverageLatency(us), 3628.344279661017
[READ], MinLatency(us), 102
[READ], MaxLatency(us), 52991
[READ], 95thPercentileLatency(us), 14991
[READ], 99thPercentileLatency(us), 46975
[READ], Return=OK, 944
[CLEANUP], Operations, 20
[CLEANUP], AverageLatency(us), 457.9
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 9159
[CLEANUP], 95thPercentileLatency(us), 2
[CLEANUP], 99thPercentileLatency(us), 9159
[SCAN], Operations, 56
[SCAN], AverageLatency(us), 100204.46428571429
[SCAN], MinLatency(us), 614
[SCAN], MaxLatency(us), 286975
[SCAN], 95thPercentileLatency(us), 224767
[SCAN], 99thPercentileLatency(us), 258175
[SCAN], Return=OK, 56